{"meta":{"title":"Economy, Finance & Statistics","subtitle":"Blog of Kroraina","description":"Yet how often is the lamp of the wicked snuffed out? How often does calamity come upon them, the fate God allots in his anger?","author":"Kroraina","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"Relationship between money supply and property price","slug":"Relationship-between-money-supply-and-property-price-1","date":"2018-01-14T06:38:45.000Z","updated":"2018-01-14T09:31:07.511Z","comments":true,"path":"2018/01/14/Relationship-between-money-supply-and-property-price-1/","link":"","permalink":"http://yoursite.com/2018/01/14/Relationship-between-money-supply-and-property-price-1/","excerpt":"","text":"It is an awful error to believe that property price will always increase &#40;decrease&#41; when money supply increases &#40;decreases&#41;because in fact there is no logical reason for the observed relationship among the two variables &#40;figure 1, came from the network&#41;. Prediction for property price based on such a spurious regression sometimes leads to terrible result because positive correlation does not inevitably exist between them. To the contrary. For example, in Japan, the average price of land had been sharply decreasing for 1992-2005 even money supply increased from 918 trillion JPY in 1992 to 1,042 trillion JPY in 2005. Similarly, land price had been consistently falling for another 4 years while M3 rose from 1,071 trillion JPY in 2009 to 1,147 trillion JPY in 2012. Land price did gain moderate growth in 2006-2008 but subsequently it turned down again due to the world financial crisis. Real turning point appeared in 2013. Since then, the rise in land price has been lasting for five consecutive years for which a strong positive correlation between money supply and land price can be found according to published data. At the same time, Japan&#39;s economy has successfully struggled to achieve 2.5&#37; expansion in Q3 last year, well exceeding expectations, and is obviously experiencing robust recovery from two-decade&#39;s recession. Figure 2 provides the data for and the relationship between money supply &#40;M3&#41; and land price in Japan from 1984 to 2016. Here land price is observed as a proxy for property price as numbers of property prices for those calendar years are not readily available. By the way, many other factors such as industry policy, bank behavior, regulation, population mindset etc. should be taken into account for property price analysis and prediction purposes.","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2018-01-13T07:49:14.065Z","updated":"2018-01-13T07:49:14.066Z","comments":true,"path":"2018/01/13/hello-world/","link":"","permalink":"http://yoursite.com/2018/01/13/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}